#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```


Warning: Argument is deprecated

  with aws_eip.nat_gateway_eip,
  on infrastructure.tf line 52, in resource "aws_eip" "nat_gateway_eip":
  52:   vpc = true

use domain attribute instead
Success! The configuration is valid, but there were some validation warnings
as shown above.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_secretsmanager_secret.AWS_ACCESS_KEY_ID: Refreshing state... [id=arn:aws:secretsmanager:ap-south-1:508656221602:secret:ecs-runner-AWS_ACCESS_KEY_ID-Ce6nJu]
aws_ecr_repository.ECR_repository: Refreshing state... [id=ecs-runner]
aws_secretsmanager_secret.REPO: Refreshing state... [id=arn:aws:secretsmanager:ap-south-1:508656221602:secret:ecs-runner-REPO-Oe3Bht]
aws_ecs_cluster.ecs_cluster: Refreshing state... [id=arn:aws:ecs:ap-south-1:508656221602:cluster/ecs-runner-cluster]
aws_secretsmanager_secret.ORG: Refreshing state... [id=arn:aws:secretsmanager:ap-south-1:508656221602:secret:ecs-runner-ORG-4ggH6u]
aws_secretsmanager_secret.PAT: Refreshing state... [id=arn:aws:secretsmanager:ap-south-1:508656221602:secret:ecs-runner-PAT-fgdVDt]
aws_secretsmanager_secret.AWS_DEFAULT_REGION: Refreshing state... [id=arn:aws:secretsmanager:ap-south-1:508656221602:secret:ecs-runner-AWS_DEFAULT_REGION-Ege2jc]
aws_iam_role.ecs_task_execution_role: Refreshing state... [id=ecs-runner_ecs_task_execution_role]
aws_secretsmanager_secret.AWS_SECRET_ACCESS_KEY: Refreshing state... [id=arn:aws:secretsmanager:ap-south-1:508656221602:secret:ecs-runner-AWS_SECRET_ACCESS_KEY-Oe3Bht]
aws_eip.nat_gateway_eip: Refreshing state... [id=eipalloc-0e7fc431ff5a103e9]
aws_vpc.vpc: Refreshing state... [id=vpc-07498bf92e0c86bd9]
aws_iam_role_policy_attachment.admin-policy-attachment: Refreshing state... [id=ecs-runner_ecs_task_execution_role-20231113193744458800000002]
aws_iam_role_policy_attachment.ecs-task-execution-role-policy-attachment: Refreshing state... [id=ecs-runner_ecs_task_execution_role-20231113193744423200000001]
aws_secretsmanager_secret_version.PAT_version: Refreshing state... [id=arn:aws:secretsmanager:ap-south-1:508656221602:secret:ecs-runner-PAT-fgdVDt|BFAF2160-F282-4031-BFC2-2187407A61DD]
aws_secretsmanager_secret_version.AWS_SECRET_ACCESS_KEY_version: Refreshing state... [id=arn:aws:secretsmanager:ap-south-1:508656221602:secret:ecs-runner-AWS_SECRET_ACCESS_KEY-Oe3Bht|CC47C722-B5F8-4ED6-A786-78EA714E3E83]
aws_secretsmanager_secret_version.ORG_version: Refreshing state... [id=arn:aws:secretsmanager:ap-south-1:508656221602:secret:ecs-runner-ORG-4ggH6u|DEC188B0-3045-46AA-9874-230FA70FD577]
aws_secretsmanager_secret_version.AWS_ACCESS_KEY_ID_version: Refreshing state... [id=arn:aws:secretsmanager:ap-south-1:508656221602:secret:ecs-runner-AWS_ACCESS_KEY_ID-Ce6nJu|D5A15F32-590B-419B-99AD-66E52CF231CF]
aws_secretsmanager_secret_version.REPO_version: Refreshing state... [id=arn:aws:secretsmanager:ap-south-1:508656221602:secret:ecs-runner-REPO-Oe3Bht|547BCED4-3D1A-4D18-8086-8B669105FF1A]
aws_secretsmanager_secret_version.AWS_DEFAULT_REGION_version: Refreshing state... [id=arn:aws:secretsmanager:ap-south-1:508656221602:secret:ecs-runner-AWS_DEFAULT_REGION-Ege2jc|82B59D96-9E50-4ABE-B34B-931684C50975]
aws_subnet.private_subnet: Refreshing state... [id=subnet-04f6bd53f3b41f090]
aws_internet_gateway.int_gateway: Refreshing state... [id=igw-01c1b694a42658781]
aws_subnet.public_subnet: Refreshing state... [id=subnet-0685110895bc6f5ee]
aws_route_table.route_table_public: Refreshing state... [id=rtb-063216b5f5f2501f8]
aws_nat_gateway.nat_gateway: Refreshing state... [id=nat-0080321254bfa3ed1]
aws_route_table_association.assoc_1: Refreshing state... [id=rtbassoc-0db31f2d7338db67b]
aws_route_table.route_table_private: Refreshing state... [id=rtb-00757056dc1d18288]
aws_route_table_association.assoc_2: Refreshing state... [id=rtbassoc-09bca5dc650e00b1b]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_appautoscaling_policy.dev_to_cpu will be created
  + resource "aws_appautoscaling_policy" "dev_to_cpu" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "dev-to-cpu"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "service/ecs-runner-cluster/ecs-runner-ecs-service"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in = false
          + target_value     = 60

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageCPUUtilization"
            }
        }
    }

  # aws_appautoscaling_policy.dev_to_memory will be created
  + resource "aws_appautoscaling_policy" "dev_to_memory" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "dev-to-memory"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "service/ecs-runner-cluster/ecs-runner-ecs-service"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in = false
          + target_value     = 80

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageMemoryUtilization"
            }
        }
    }

  # aws_appautoscaling_target.dev_to_target will be created
  + resource "aws_appautoscaling_target" "dev_to_target" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + max_capacity       = 2
      + min_capacity       = 1
      + resource_id        = "service/ecs-runner-cluster/ecs-runner-ecs-service"
      + role_arn           = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"
      + tags_all           = (known after apply)
    }

  # aws_cloudwatch_log_group.ecs-log-group will be created
  + resource "aws_cloudwatch_log_group" "ecs-log-group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/ecs/ecs-runner-task-def"
      + name_prefix       = (known after apply)
      + retention_in_days = 0
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # aws_ecs_service.ecs_service will be created
  + resource "aws_ecs_service" "ecs_service" {
      + cluster                            = "arn:aws:ecs:ap-south-1:508656221602:cluster/ecs-runner-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "ecs-runner-ecs-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = [
              + "subnet-04f6bd53f3b41f090",
            ]
        }
    }

  # aws_ecs_task_definition.task_definition will be created
  + resource "aws_ecs_task_definition" "task_definition" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + command          = [
                      + "./start.sh",
                    ]
                  + cpu              = 256
                  + essential        = true
                  + image            = "508656221602.dkr.ecr.ap-south-1.amazonaws.com/ecs-runner:latest"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/ecs/ecs-runner-task-def"
                          + awslogs-region        = "ap-northeast-1"
                          + awslogs-stream-prefix = "ecs"
                        }
                    }
                  + memory           = 512
                  + name             = "ecs-runner"
                  + portMappings     = [
                      + {
                          + containerPort = 80
                        },
                    ]
                  + secrets          = [
                      + {
                          + name      = "PAT"
                          + valueFrom = "arn:aws:secretsmanager:ap-south-1:508656221602:secret:ecs-runner-PAT-fgdVDt"
                        },
                      + {
                          + name      = "ORG"
                          + valueFrom = "arn:aws:secretsmanager:ap-south-1:508656221602:secret:ecs-runner-ORG-4ggH6u"
                        },
                      + {
                          + name      = "REPO"
                          + valueFrom = "arn:aws:secretsmanager:ap-south-1:508656221602:secret:ecs-runner-REPO-Oe3Bht"
                        },
                      + {
                          + name      = "AWS_DEFAULT_REGION"
                          + valueFrom = "arn:aws:secretsmanager:ap-south-1:508656221602:secret:ecs-runner-AWS_DEFAULT_REGION-Ege2jc"
                        },
                      + {
                          + name      = "AWS_SECRET_ACCESS_KEY"
                          + valueFrom = "arn:aws:secretsmanager:ap-south-1:508656221602:secret:ecs-runner-AWS_SECRET_ACCESS_KEY-Oe3Bht"
                        },
                      + {
                          + name      = "AWS_ACCESS_KEY_ID"
                          + valueFrom = "arn:aws:secretsmanager:ap-south-1:508656221602:secret:ecs-runner-AWS_ACCESS_KEY_ID-Ce6nJu"
                        },
                    ]
                },
            ]
        )
      + cpu                      = "512"
      + execution_role_arn       = "arn:aws:iam::508656221602:role/ecs-runner_ecs_task_execution_role"
      + family                   = "ecs-runner-task-def"
      + id                       = (known after apply)
      + memory                   = "1024"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = (known after apply)
      + task_role_arn            = "arn:aws:iam::508656221602:role/ecs-runner_ecs_task_execution_role"
    }

  # aws_iam_role_policy.password_policy_secretsmanager will be created
  + resource "aws_iam_role_policy" "password_policy_secretsmanager" {
      + id          = (known after apply)
      + name        = "password-policy-secretsmanager"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "secretsmanager:GetSecretValue",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = "ecs-runner_ecs_task_execution_role"
    }

  # aws_route_table.route_table_private will be updated in-place
  ~ resource "aws_route_table" "route_table_private" {
        id               = "rtb-00757056dc1d18288"
      ~ route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = "nat-0080321254bfa3ed1"
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = "nat-0080321254bfa3ed1"
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Name" = "ecs-runner_private"
        }
        # (5 unchanged attributes hidden)
    }

  # aws_security_group.ecs_sg will be created
  + resource "aws_security_group" "ecs_sg" {
      + arn                    = (known after apply)
      + description            = "Allow incoming traffic for ecs"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + name                   = "ecs-runner-ecs-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "ecs-runner_ecs_sg"
        }
      + tags_all               = {
          + "Name" = "ecs-runner_ecs_sg"
        }
      + vpc_id                 = "vpc-07498bf92e0c86bd9"
    }

Plan: 8 to add, 1 to change, 0 to destroy.

Warning: Argument is deprecated

  with aws_eip.nat_gateway_eip,
  on infrastructure.tf line 52, in resource "aws_eip" "nat_gateway_eip":
  52:   vpc = true

use domain attribute instead

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @pkj1993, Action: `pull_request`*